<a href="https://colab.research.google.com/github/sundarp17/Data-science/blob/main/remove_duplicates/remove_duplicates.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Why remove duplicates?**

*   To maintain accurate, consistent data sets.
*   To avoid producing erroneous or misleading statistics.

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
df = DataFrame({'column 1':[1,1,2,2,3,3,3],
                'column 2':['a','a','b','b','c','c','c'],
                'column 3':['A','A','B','B','C','C','C']})
df

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [4]:
df.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [5]:
df.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [6]:
df = DataFrame({'column 1':[1,1,2,2,3,3,3],
                'column 2':['a','a','b','b','c','c','c'],
                'column 3':['A','A','B','B','C','D','C']})
df

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [7]:
df.drop_duplicates(['column 3'])

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         3        c        D